Назначение: определение параметров подключения пользователя к базе данных.
Открывается:

* при запуске модуля;
* при выборе пункта меню **Действия / Подключение**.

![image](https://github.com/floreangeyer/WEB/blob/master/images/podkluchenie.gif?raw=truehttps://github.com/floreangeyer/WEB/blob/master/images/podkluchenie.gif?raw=true)

Описание полей:

* **Пользователь** — задает регистрационное имя пользователя.
* **Пароль** — предназначено для ввода пароля пользователя.
* **Имя подключения** — предназначено для ввода наименования подключения. Значение выбирается из списка, выпадающего при нажатии на кнопку ![image](https://github.com/floreangeyer/WEB/blob/master/images/vybor_iz_spiska.gif?raw=truehttps://github.com/floreangeyer/WEB/blob/master/images/vybor_iz_spiska.gif?raw=true).
*Примечание:* зарегистрировать новое подключение или отредактировать параметры уже зарегистрированного можно до запуска модуля в файле connections.ini, находящемся в папке сборки.
* **Далее подключаться автоматически** — флаг устанавливается в том случае, если при последующих запусках модуля не должны вводиться параметры подключения пользователя к базе данных. В результате диалог Подключение не открывается, а подключение к модулю выполняется с теми параметрами, которые были выбраны перед установкой флага. Подробнее — см. **Регистрация в системе**.

Описание кнопок:

* **ОК** — используется для применения выбранных параметров подключения.
* **Отмена** — отменяет ввод параметров подключения к базе.